traces/XXX-enumerate-all.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:addata="http://schemas.microsoft.com/2008/1/ActiveDirectory/Data" xmlns:ad="http://schemas.microsoft.com/2008/1/ActiveDirectory" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <s:Header>
  <a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</a:Action>
  <ad:instance>ldap:389</ad:instance>
  <a:MessageID>urn:uuid:1e8a2dd0-b096-4579-bcd2-08115cb0e6ff</a:MessageID>
  <a:ReplyTo>
   <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
  </a:ReplyTo>
  <a:To s:mustUnderstand="1">net.tcp://20.46.226.100:9389/ActiveDirectoryWebServices/Windows/Enumeration</a:To>
 </s:Header>
 <s:Body xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:adlq="http://schemas.microsoft.com/2008/1/ActiveDirectory/Dialect/LdapQuery">
  <wsen:Enumerate>
   <wsen:Filter Dialect="http://schemas.microsoft.com/2008/1/ActiveDirectory/Dialect/LdapQuery">
    <adlq:LdapQuery>
     <adlq:Filter>(&amp;(cn=admin*)(objectClass=user)(objectCategory=person))</adlq:Filter>
     <adlq:BaseObject>DC=garming,DC=example,DC=com</adlq:BaseObject>
     <adlq:Scope>Subtree</adlq:Scope>
    </adlq:LdapQuery>
   </wsen:Filter>
   <ad:Selection Dialect="http://schemas.microsoft.com/2008/1/ActiveDirectory/Dialect/XPath-Level-1">
    <ad:SelectionProperty>ad:distinguishedName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:name</ad:SelectionProperty>
    <ad:SelectionProperty>addata:objectClass</ad:SelectionProperty>
    <ad:SelectionProperty>addata:objectGUID</ad:SelectionProperty>
    <ad:SelectionProperty>addata:givenName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:sn</ad:SelectionProperty>
    <ad:SelectionProperty>addata:homeDirectory</ad:SelectionProperty>
    <ad:SelectionProperty>addata:homeDrive</ad:SelectionProperty>
    <ad:SelectionProperty>addata:manager</ad:SelectionProperty>
    <ad:SelectionProperty>addata:middleName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:userWorkstations</ad:SelectionProperty>
    <ad:SelectionProperty>addata:profilePath</ad:SelectionProperty>
    <ad:SelectionProperty>addata:scriptPath</ad:SelectionProperty>
    <ad:SelectionProperty>addata:userAccountControl</ad:SelectionProperty>
    <ad:SelectionProperty>addata:msDS-User-Account-Control-Computed</ad:SelectionProperty>
    <ad:SelectionProperty>addata:telephoneNumber</ad:SelectionProperty>
    <ad:SelectionProperty>addata:company</ad:SelectionProperty>
    <ad:SelectionProperty>addata:department</ad:SelectionProperty>
    <ad:SelectionProperty>addata:facsimileTelephoneNumber</ad:SelectionProperty>
    <ad:SelectionProperty>addata:initials</ad:SelectionProperty>
    <ad:SelectionProperty>addata:mobile</ad:SelectionProperty>
    <ad:SelectionProperty>addata:homePhone</ad:SelectionProperty>
    <ad:SelectionProperty>addata:physicalDeliveryOfficeName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:postalCode</ad:SelectionProperty>
    <ad:SelectionProperty>addata:postOfficeBox</ad:SelectionProperty>
    <ad:SelectionProperty>addata:st</ad:SelectionProperty>
    <ad:SelectionProperty>addata:streetAddress</ad:SelectionProperty>
    <ad:SelectionProperty>addata:title</ad:SelectionProperty>
    <ad:SelectionProperty>addata:division</ad:SelectionProperty>
    <ad:SelectionProperty>addata:c</ad:SelectionProperty>
    <ad:SelectionProperty>addata:l</ad:SelectionProperty>
    <ad:SelectionProperty>addata:employeeID</ad:SelectionProperty>
    <ad:SelectionProperty>addata:employeeNumber</ad:SelectionProperty>
    <ad:SelectionProperty>addata:o</ad:SelectionProperty>
    <ad:SelectionProperty>addata:mail</ad:SelectionProperty>
    <ad:SelectionProperty>addata:userPrincipalName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:accountExpires</ad:SelectionProperty>
    <ad:SelectionProperty>addata:lockoutTime</ad:SelectionProperty>
    <ad:SelectionProperty>addata:badPwdCount</ad:SelectionProperty>
    <ad:SelectionProperty>addata:nTSecurityDescriptor</ad:SelectionProperty>
    <ad:SelectionProperty>addata:userCertificate</ad:SelectionProperty>
    <ad:SelectionProperty>addata:badPasswordTime</ad:SelectionProperty>
    <ad:SelectionProperty>addata:lastLogonTimestamp</ad:SelectionProperty>
    <ad:SelectionProperty>addata:pwdLastSet</ad:SelectionProperty>
    <ad:SelectionProperty>addata:primaryGroupID</ad:SelectionProperty>
    <ad:SelectionProperty>addata:objectSid</ad:SelectionProperty>
    <ad:SelectionProperty>addata:servicePrincipalName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:msDS-SupportedEncryptionTypes</ad:SelectionProperty>
    <ad:SelectionProperty>addata:msDS-AllowedToActOnBehalfOfOtherIdentity</ad:SelectionProperty>
    <ad:SelectionProperty>addata:msDS-AssignedAuthNPolicy</ad:SelectionProperty>
    <ad:SelectionProperty>addata:msDS-AssignedAuthNPolicySilo</ad:SelectionProperty>
    <ad:SelectionProperty>addata:sAMAccountName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:wWWHomePage</ad:SelectionProperty>
    <ad:SelectionProperty>addata:sIDHistory</ad:SelectionProperty>
    <ad:SelectionProperty>addata:memberOf</ad:SelectionProperty>
    <ad:SelectionProperty>addata:canonicalName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:cn</ad:SelectionProperty>
    <ad:SelectionProperty>addata:createTimeStamp</ad:SelectionProperty>
    <ad:SelectionProperty>addata:description</ad:SelectionProperty>
    <ad:SelectionProperty>addata:displayName</ad:SelectionProperty>
    <ad:SelectionProperty>addata:isDeleted</ad:SelectionProperty>
    <ad:SelectionProperty>addata:lastKnownParent</ad:SelectionProperty>
    <ad:SelectionProperty>addata:modifyTimeStamp</ad:SelectionProperty>
    <ad:SelectionProperty>addata:objectCategory</ad:SelectionProperty>
    <ad:SelectionProperty>addata:sdRightsEffective</ad:SelectionProperty>
    <ad:SelectionProperty>addata:instanceType</ad:SelectionProperty>
    <ad:SelectionProperty>ad:all</ad:SelectionProperty>
   </ad:Selection>
  </wsen:Enumerate>
 </s:Body>
</s:Envelope>
